[
  {
    "name": "Fullstack Bug Tracker",
    "url": "https://bug-tracker-vercel.vercel.app/",
    "github": "https://github.com/RKirlew/bug-tracker-vercel/",
    "image": "fbt.png",
    "description": "This project allowed users to create, track, and manage bugs in real-time, boosting productivity and streamlining bug management. Implemented state management using React Context API, enhancing performance and scalability. Successfully achieved 99.9% uptime and reduced deployment time by 40% through deployment on Vercel.",
    "stack": ["React", "NodeJS", "Firebase","ChakraUI"]
  },
 {
    "name": "Handwritten Digit Recognition with CNNs",
   
    "github":"https://github.com/RKirlew/Handwritten-Digit-Recognizer",
       "description": "Developed a Convolutional Neural Network (CNN) model for classifying handwritten digits using the MNIST dataset, achieving a test accuracy of 90%. Designed a model with 64 convolutional filters, MaxPooling layers, and Dropout to reduce overfitting and improve generalization. Optimized training using EarlyStopping and ModelCheckpoint, reducing training time by 20% while maintaining high accuracy.",
    "stack": ["Keras", "Tensorflow", "Python","MNIST Dataset"]
  },

  {
  "name": "Perceptron From Scratch",
  "image": "https://db0dce98.rocketcdn.me/en/files/2021/04/illu_perceptron_blog-138.png",
  "github": "https://github.com/RKirlew/Simple-Perceptron-Implementation",
  "description": "A C++ implementation of a Perceptron model, inspired by Frank Rosenblatt's original 1957 design. It demonstrates how weighted inputs, bias, and threshold combine to make binary decisions, simulating the behavior of a neuron.",
  "stack": ["C++", "OOP", "Neural Networks"]
},

{
    "name": "Custom Named Entity Recognition (NER) Model Development",
       "github": "https://github.com/RKirlew/Custom-Resume-NER-Model-Development-with-spaCy",
    "image": "ner.png",
    "description": "Developed a custom Named Entity Recognition (NER) model using spaCy, trained on manually annotated data to accurately extract domain-specific entities from text. The project included building a clean annotation pipeline, training the model on structured JSON data, and validating its performance on unseen examples."
    "stack": ["spaCy", "Python", "NLP","JSON","scikit-learn"]
  }, 


{
    "name": "League of Legends Champion Classifier using K-Nearest Neighbors (KNN)",
    
    "github": "https://github.com/RKirlew/League-of-Legends-Champion-Classifier-using-K-Nearest-Neighbors-KNN-",
       "description": "This project leverages machine learning to classify champions in the popular game League of Legends based on their attributes. The model predicts a champion's class (e.g., Assassin, Tank, Mage) using features such as Base HP, Base Mana, Difficulty, Role, and Range Type. This project showcases a complete ML pipeline, including data preprocessing, feature engineering, and model evaluation.",
    "stack": ["Python", "scikit-learn", "K-Nearest-Neighbours","Pandas"]
  },
{
    "name": "Elm Media Player",
    "image":"https://github.com/RKirlew/Elm-Media-Player/raw/main/elmplayer.gif",
    "github": "https://github.com/RKirlew/Elm-Media-Player",
       "description": "A simple to use media player which uses the BASS library for audio playback and for the Fast Fourier Transformation visualization. Utilizes ImGUI for the GUI and for plotting the FFT.",
    "stack": ["C++", "ImGui", "BASS"]
  },

{
    "name": "Gratitud.ly",
    "image":"grat.png",
    "github": "https://github.com/RKirlew/Gratitud.ly",
       "description": "The Gratitude Tracker App is a mobile application developed using Flutter and integrated with Firebase backend. The app allows users to record their daily moments of gratitude and tracks their mood scores over time. It also provides data visualization and basic statistics on gratitude entries and mood scores. Additionally, the app offers personalized suggestions to improve mood based on the user's mood score. ",
    "stack": ["Flutter", "Firebase", "Dart"]
  }





]
